ERP.belugaerp/src/AccumulationRegisters/РаспределениеЗапасовДвижения/РаспределениеЗапасовДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РаспределениеЗапасовДвижения</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Резервировать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>КОбеспечениюБезРезерва</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>НеОбеспечивать</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Поступило</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ПоступитКДате</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ПоставкаНаСогласовании</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ЗакрытьГрафикПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>ЗакрытьГрафикОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ЗаказНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>ЖелаемаяДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
  <dimensions>
    <name>ЗаказНаПоступление</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/InformationRegisters/бг_ИзмененияСвободныхОстатковДляИМ/бг_ИзмененияСвободныхОстатковДляИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_ИзмененияСвободныхОстатковДляИМ</name>
  <comment>Служебный регистр для сбора информации об изменения свободных остатков товаров для передачи оперативных остатков сайту интернет-магазина.</comment>
  <resources>
    <name>Свободно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПричинаИзменения</name>
    <type>
      <types>EnumRef.бг_ПричиныИзмененияСвободныхОстатковДляИМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделительЗаписи</name>
    <comment>Служебное измерение, предназначенное для укрупнения порции записи данных в регистр</comment>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/Enums/бг_ИсточникиЗагрузкиЗаказовКлиентов/бг_ИсточникиЗагрузкиЗаказовКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ИсточникиЗагрузкиЗаказовКлиентов</name>
  <enumValues>
    <name>B2B</name>
  </enumValues>
  <enumValues>
    <name>Creatio</name>
  </enumValues>
  <enumValues>
    <name>EDI</name>
  </enumValues>
  <enumValues>
    <name>PortalDistr</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_SAP_СONSOLIDATED</name>
  </enumValues>
  <enumValues>
    <name>WINELAB_HYBRIS</name>
  </enumValues>
  <enumValues>
    <name>СобственныйКонтрагент</name>
  </enumValues>
  <enumValues>
    <name>ТвойДом</name>
  </enumValues>
  <enumValues>
    <name>Чикаго</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/бг_ПричиныИзмененияСвободныхОстатковДляИМ/бг_ПричиныИзмененияСвободныхОстатковДляИМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>бг_ПричиныИзмененияСвободныхОстатковДляИМ</name>
  <enumValues>
    <name>ИнтернетЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеОперации</name>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/AccumulationRegisters/РаспределениеЗапасовДвижения/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ПриЗаписи")
Процедура бг_ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка
		И Не (ДополнительныеСвойства.Свойство("ЗаменаСсылок") И ДополнительныеСвойства.ЗаменаСсылок) Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);
	
	Если ПроведениеДокументов.РассчитыватьИзменения(ДополнительныеСвойства) Тогда
		бг_ЗаписатьИзмененияСвободныхОстатковДляИМ();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура бг_ЗаписатьИзмененияСвободныхОстатковДляИМ()

	Если Не ДополнительныеСвойства.ТаблицыКонтроля.ДвиженияРаспределениеЗапасовДвиженияИзменение.ЕстьЗаписиВТаблице Тогда
		Возврат;	
	КонецЕсли;	
	
	Если Не бг_КонстантыПовтИсп.ФункциональнаяОпцияИспользуется("ИспользоватьВыгрузкуСвободныхОстатковВSAP") Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерВременныхТаблиц = ДополнительныеСвойства.МенеджерВременныхТаблиц;
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИзмененияДвижений.Номенклатура КАК Номенклатура,
	|	ИзмененияДвижений.Характеристика КАК Характеристика,
	|	ИзмененияДвижений.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ИзмененияДвижений.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).бг_ИсточникЗаказа = ЗНАЧЕНИЕ(Перечисление.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_HYBRIS)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бг_ПричиныИзмененияСвободныхОстатковДляИМ.ИнтернетЗаказ)
	|		КОГДА ВЫРАЗИТЬ(ИзмененияДвижений.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).бг_ИсточникЗаказа = ЗНАЧЕНИЕ(Перечисление.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_SAP_СONSOLIDATED)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бг_ПричиныИзмененияСвободныхОстатковДляИМ.ИнтернетЗаказ)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бг_ПричиныИзмененияСвободныхОстатковДляИМ.ПрочиеОперации)
	|	КОНЕЦ КАК ПричинаИзменения,
	|	СУММА(ИзмененияДвижений.Поступило - (ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать)) КАК Свободно
	|ИЗ
	|	ДвиженияРаспределениеЗапасовДвиженияИзменение КАК ИзмененияДвижений
	|ГДЕ
	|	НЕ ЕСТЬNULL(ВЫРАЗИТЬ(ИзмененияДвижений.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).бг_ДолгосрочныйРезерв, ЛОЖЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИзмененияДвижений.Номенклатура,
	|	ИзмененияДвижений.Характеристика,
	|	ИзмененияДвижений.Склад,
	|	ВЫБОР
	|		КОГДА ВЫРАЗИТЬ(ИзмененияДвижений.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).бг_ИсточникЗаказа = ЗНАЧЕНИЕ(Перечисление.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_HYBRIS)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бг_ПричиныИзмененияСвободныхОстатковДляИМ.ИнтернетЗаказ)
	|		КОГДА ВЫРАЗИТЬ(ИзмененияДвижений.ЗаказНаОтгрузку КАК Документ.ЗаказКлиента).бг_ИсточникЗаказа = ЗНАЧЕНИЕ(Перечисление.бг_ИсточникиЗагрузкиЗаказовКлиентов.WINELAB_SAP_СONSOLIDATED)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.бг_ПричиныИзмененияСвободныхОстатковДляИМ.ИнтернетЗаказ)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.бг_ПричиныИзмененияСвободныхОстатковДляИМ.ПрочиеОперации)
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	СУММА(ИзмененияДвижений.Поступило - (ИзмененияДвижений.Отгрузить + ИзмененияДвижений.Резервировать)) <> 0";

	Таблица = Запрос.Выполнить().Выгрузить();
	Таблица.Колонки.Добавить("РазделительЗаписи");
	РазделительЗаписи = Новый УникальныйИдентификатор();
	Таблица.ЗаполнитьЗначения(РазделительЗаписи, "РазделительЗаписи");
	Таблица.Колонки.Добавить("ДатаЗаписи");
	Таблица.ЗаполнитьЗначения(ТекущаяДатаСеанса(), "ДатаЗаписи");
	
	Набор = РегистрыСведений.бг_ИзмененияСвободныхОстатковДляИМ.СоздатьНаборЗаписей();
	Набор.Загрузить(Таблица);
	Набор.Отбор.РазделительЗаписи.Установить(РазделительЗаписи);
	Набор.Записать(Ложь);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
